{
  "backend/main.mo": "Motoko backend implementing access control, user profiles, blob storage mixin, rate card CRUD, and quote-related types and operations.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of various frontend files across the application.",
  "frontend/index.html": "HTML entry point loading SheetJS and jsPDF libraries and bootstrapping the React app.",
  "frontend/src/App.tsx": "Main React wrapper configuring theme, React Query provider, layout shell, and rendering MainApp.",
  "frontend/src/components/AccountManagerManager.tsx": "UI for uploading, adding, listing, and deleting account managers with CSV import and template download.",
  "frontend/src/components/AnalysisTab.tsx": "Quote analysis interface enabling cost editing, margin calculations, and Excel/PDF export.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button component for handling Internet Identity authentication.",
  "frontend/src/components/MainApp.tsx": "Top-level component managing tab navigation and current quote state, rendering generators, analysis, history, reports, rate card, and settings tabs.",
  "frontend/src/components/ProfileSetup.tsx": "File is empty with no implementation.",
  "frontend/src/components/QuoteGenerator.tsx": "Handles item selection, filtering, quote generation, and analysis requests using rate card data and form inputs.",
  "frontend/src/components/QuoteHistoryTab.tsx": "Displays past quotes in a table, allowing users to reload a selected quote into the app.",
  "frontend/src/components/QuoteSummary.tsx": "Shows a formatted summary of a generated quote with options to print or export to Excel or PDF.",
  "frontend/src/components/RateCardManager.tsx": "Allows uploading, parsing, previewing, and updating the rate card via CSV or Excel files.",
  "frontend/src/components/RateCardPreview.tsx": "Shows a preview of parsed rate card items and prompts the user to confirm replacing existing data.",
  "frontend/src/components/RateCardTable.tsx": "Renders a scrollable table displaying rate card items with key fields and formatted costs.",
  "frontend/src/components/ReportsTab.tsx": "Displays quote history, allows selecting a quote, and exports selected quote details to Excel.",
  "frontend/src/components/SettingsTab.tsx": "Renders settings UI containing account manager management.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and handling login, logout, and status.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for rate cards, quotes, analysis, and account manager operations.",
  "frontend/src/index.css": "Defines global Tailwind styles, color variables, dark mode themes, and print styles.",
  "frontend/src/lib/accountManagerParser.ts": "Parses CSV or Excel files to extract account manager name and email, with validation and error handling.",
  "frontend/src/lib/excelParser.ts": "Parses .xlsx files in the browser using SheetJS, maps header columns, validates required fields, and returns structured item data.",
  "frontend/src/lib/formatters.ts": "Provides number, currency, and percentage formatting helpers used throughout the UI.",
  "frontend/src/lib/pdfExporter.ts": "Generates styled quote or analysis PDFs using jsPDF and autotable, formatting headers, tables, and totals before saving to file.",
  "frontend/src/main.tsx": "Initializes the React application with React Query and Internet Identity providers and mounts the App component.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Tracks project metadata, feature requirements, and state for implementing styled PDF quote exports."
}